Revit 2026 API

# ApplicationOpenIFCDocument(String) Method

---

Opens an IFC document from disk using default options.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Document OpenIFCDocument(
	string fileName
)
```
```vb
Public Function OpenIFCDocument (
	fileName As String
) As Document
```
```cpp
public:
Document^ OpenIFCDocument(
	String^ fileName
)
```
```fsharp
member OpenIFCDocument :
        fileName : string -> Document
```

#### Parameters

fileName String
     The IFC file to be opened.

#### Return Value

Document The newly created document containing the IFC file.

| Exception | Condition |
| --- | --- |
| ArgumentException | If 'fileName' is an empty string. |
| ArgumentNullException | If  is passed as 'fileName' -or- A non-optional argument was null |
| FileArgumentNotFoundException | If the file specified by 'fileName' cannot be found. |
| InvalidOperationException | If Revit is missing document templates or if the file cannot be opened. |

#### Reference

Application Class

OpenIFCDocument Overload

Autodesk.Revit.ApplicationServices Namespace